<template>
    <div class="procedures">
        <div class="procedures-title container">
        Все процедуры
        </div>
        <div class="procedures__content container">
            <div class="procedures__list">
                <ProceduresItem
                v-for="(item,index) of ProceduresItems" :key="index"
                :procedurItem="item"
                />
            </div>
        </div>
    </div>
</template>

<script setup lang="ts">
    import ProceduresItem from "@/components/ProceduresItem.vue"
    const ProceduresItems = [
        {lot:'21000021580000001188 (Лот 1)',section:'Имущественные торги (178-ФЗ)',name:'Продажа имущества , находящегося в оперативном управлении ГБУ «Жилищник района Куркино» в объекте гаражного назначения по адресу:гор Москва, Юровская улица, дом 103, площадь 17,7 кв.м. (Этаж 3, пом VIII, мм 183), кадастровый номер 77:08:0000000:2056',
        seller:'ГОСУДАРСТВЕННОЕ БЮДЖЕТНОЕ УЧРЕЖДЕНИЕ ГОРОДА МОСКВЫ "ЖИЛИЩНИК РАЙОНА КУРКИНО"',form:'Аукцион в электронной форме',price:327500,
        time:'Окончание приема заявок: 12.05.2023 в 15:00 (34 дн.)',place:'77. г. Москва'
        },
        {lot:'21000021580000001188 (Лот 1)',section:'Имущественные торги (178-ФЗ)',name:'Продажа имущества , находящегося в оперативном управлении ГБУ «Жилищник района Куркино» в объекте гаражного назначения по адресу:гор Москва, Юровская улица, дом 103, площадь 17,7 кв.м. (Этаж 3, пом VIII, мм 183), кадастровый номер 77:08:0000000:2056',
        seller:'ГОСУДАРСТВЕННОЕ БЮДЖЕТНОЕ УЧРЕЖДЕНИЕ ГОРОДА МОСКВЫ "ЖИЛИЩНИК РАЙОНА КУРКИНО"',form:'Аукцион в электронной форме',price:327500,
        time:'Окончание приема заявок: 12.05.2023 в 15:00 (34 дн.)',place:'77. г. Москва'
        },
        {lot:'21000021580000001188 (Лот 1)',section:'Имущественные торги (178-ФЗ)',name:'Продажа имущества , находящегося в оперативном управлении ГБУ «Жилищник района Куркино» в объекте гаражного назначения по адресу:гор Москва, Юровская улица, дом 103, площадь 17,7 кв.м. (Этаж 3, пом VIII, мм 183), кадастровый номер 77:08:0000000:2056',
        seller:'ГОСУДАРСТВЕННОЕ БЮДЖЕТНОЕ УЧРЕЖДЕНИЕ ГОРОДА МОСКВЫ "ЖИЛИЩНИК РАЙОНА КУРКИНО"',form:'Аукцион в электронной форме',price:327500,
        time:'Окончание приема заявок: 12.05.2023 в 15:00 (34 дн.)',place:'77. г. Москва'
        },
    ]
</script>

<style lang="scss" scoped>
.procedures {
    padding-top: 50px;
    &__content {
        margin-top: 20px;
    }
}
.procedures-title {
    font-size: 32px;
    font-weight: 400;
    line-height: 40px;
}
</style>